[
  {
    "id": "sci_6_1",
    "grade": 6,
    "subject": "विज्ञान (Science)",
    "topic": "प्रकाश और छाया",
    "keywords": ["प्रकाश", "छाया", "परावर्तन", "पारदर्शी", "अपारदर्शी"],
    "summary": "प्रकाश के गुण, छाया का निर्माण और पदार्थों के प्रकार को समझना।",
    "pages": [
      { "title": "प्रकाश के स्रोत", "content": "प्रकाश ऊर्जा का एक रूप है जो हमें देखने में मदद करता है। प्राकृतिक स्रोतों में सूर्य और तारे शामिल हैं। कृत्रिम स्रोतों में बल्ब, मोमबत्तियां और टॉर्च शामिल हैं। प्रकाश सीधी रेखा में यात्रा करता है।" },
      { "title": "पारदर्शी और अपारदर्शी", "content": "पारदर्शी वस्तुएं प्रकाश को पूरी तरह से गुजरने देती हैं (जैसे कांच)। अपारदर्शी वस्तुएं प्रकाश को नहीं गुजरने देतीं (जैसे लकड़ी या धातु)। पारभासी वस्तुएं कुछ प्रकाश को गुजरने देती हैं (जैसे मक्खन का कागज)।" },
      { "title": "छाया का निर्माण", "content": "जब कोई अपारदर्शी वस्तु प्रकाश को रोकती है तो छाया बनती है। छाया का आकार वस्तु, प्रकाश स्रोत और पर्दे के बीच की दूरी पर निर्भर करता है। छाया हमेशा प्रकाश स्रोत के विपरीत दिशा में बनती है।" },
      { "title": "प्रकाश का परावर्तन", "content": "जब प्रकाश दर्पण जैसी चिकनी चमकदार सतह पर पड़ता है, तो वह वापस उछलता है। इसे परावर्तन कहते हैं। जिस कोण पर प्रकाश सतह से टकराता है वह कोण उसके परावर्तन के कोण के बराबर होता है।" }
    ]
  },
  {
    "id": "sci_6_2",
    "grade": 6,
    "subject": "विज्ञान (Science)",
    "topic": "हमारे चारों ओर वायु",
    "keywords": ["वायु", "ऑक्सीजन", "वायुमंडल", "हवा", "श्वसन"],
    "summary": "वायु की संरचना, इसके गुण और जीवित प्राणियों के लिए महत्व।",
    "pages": [
      { "title": "वायु क्या है?", "content": "वायु गैसों का एक मिश्रण है जो पृथ्वी को घेरे हुए है। मुख्य गैसें हैं नाइट्रोजन (78%), ऑक्सीजन (21%), और कार्बन डाइऑक्साइड, जल वाष्प आदि की थोड़ी मात्रा। हम वायु को देख या चख नहीं सकते, लेकिन हवा चलने पर महसूस कर सकते हैं।" },
      { "title": "वायु के गुण", "content": "वायु स्थान घेरती है और इसका वजन होता है। हम यह साबित कर सकते हैं कि वायु स्थान घेरती है - एक खाली गिलास को पानी में उल्टा करने पर पानी उसे पूरी तरह नहीं भरता। वायु सभी दिशाओं में दबाव डालती है।" },
      { "title": "ऑक्सीजन और जीवन", "content": "सभी जीवित प्राणियों को सांस लेने और जीवित रहने के लिए ऑक्सीजन की आवश्यकता होती है। पौधे सूर्य के प्रकाश की उपस्थिति में प्रकाश संश्लेषण के दौरान ऑक्सीजन छोड़ते हैं। जानवर और मनुष्य ऑक्सीजन अंदर लेते हैं और कार्बन डाइऑक्साइड बाहर छोड़ते हैं।" },
      { "title": "वायुमंडल की परतें", "content": "पृथ्वी को घेरने वाली वायु की परत को वायुमंडल कहते हैं। यह हमें सूर्य की हानिकारक किरणों से बचाता है और तापमान बनाए रखता है। इसकी विभिन्न परतें हैं: क्षोभमंडल (यहां मौसम होता है), समताप मंडल (ओजोन परत होती है), और अन्य।" }
    ]
  },
  {
    "id": "sci_6_3",
    "grade": 6,
    "subject": "विज्ञान (Science)",
    "topic": "जल और जल चक्र",
    "keywords": ["जल", "वाष्पीकरण", "संघनन", "वर्षा", "चक्र"],
    "summary": "जल की अवस्थाएं, जल चक्र और जल संरक्षण।",
    "pages": [
      { "title": "जल की तीन अवस्थाएं", "content": "जल तीन अवस्थाओं में पाया जाता है: ठोस (बर्फ), तरल (पानी), और गैस (जल वाष्प या भाप)। गर्म या ठंडा करने पर जल अपनी अवस्था बदलता है। बर्फ 0°C पर पिघलती है और पानी 100°C पर उबलता है।" },
      { "title": "जल चक्र", "content": "पृथ्वी पर पानी एक चक्र में घूमता रहता है। सूर्य नदियों, झीलों और महासागरों में पानी को गर्म करता है जिससे वाष्पीकरण होता है। जल वाष्प ऊपर उठती है, ठंडी होती है और बादल बनाती है (संघनन)। जब बादल भारी हो जाते हैं, तो पानी बारिश, बर्फ या ओलों के रूप में गिरता है (वर्षा)।" },
      { "title": "जल के स्रोत", "content": "नदियां, झीलें, तालाब, कुएं और भूजल मीठे पानी के स्रोत हैं। महासागरों में खारा पानी होता है जो पीने योग्य नहीं है। पृथ्वी के केवल 3% पानी मीठा है और उसका अधिकांश भाग ग्लेशियरों में जमा हुआ है।" },
      { "title": "जल संरक्षण", "content": "हमें पानी बचाना चाहिए क्योंकि मीठा पानी सीमित है। उपयोग में न होने पर नल बंद करें, टपकते पाइप ठीक करें, पौधों के लिए पानी का पुन: उपयोग करें, और वर्षा जल संचयन करें। नहाते या धोते समय पानी बर्बाद करने से बचें।" }
    ]
  },
  {
    "id": "sci_6_4",
    "grade": 6,
    "subject": "विज्ञान (Science)",
    "topic": "विद्युत और परिपथ",
    "keywords": ["विद्युत", "परिपथ", "चालक", "कुचालक", "बैटरी"],
    "summary": "विद्युत परिपथ, चालक और कुचालक की बुनियादी अवधारणाएं।",
    "pages": [
      { "title": "विद्युत क्या है?", "content": "विद्युत ऊर्जा का एक रूप है जो बल्ब, पंखे और मशीनों को शक्ति देती है। विद्युत धारा चालक के माध्यम से इलेक्ट्रॉनों का प्रवाह है। बैटरी या सेल उपकरणों को चलाने के लिए विद्युत ऊर्जा प्रदान करती है।" },
      { "title": "विद्युत परिपथ", "content": "बंद मार्ग जिसके माध्यम से विद्युत प्रवाहित होती है उसे विद्युत परिपथ कहते हैं। एक साधारण परिपथ में सेल (बैटरी), जोड़ने वाले तार, एक बल्ब और एक स्विच होता है। बल्ब तभी जलता है जब परिपथ पूर्ण और बंद हो।" },
      { "title": "चालक और कुचालक", "content": "जो पदार्थ विद्युत को अपने से होकर गुजरने देते हैं उन्हें चालक कहते हैं। उदाहरणों में तांबा, एल्युमीनियम और लोहे जैसी धातुएं शामिल हैं। जो पदार्थ विद्युत को नहीं गुजरने देते उन्हें कुचालक कहते हैं जैसे रबर, प्लास्टिक और लकड़ी।" },
      { "title": "विद्युत के साथ सुरक्षा", "content": "गीले हाथों से कभी भी विद्युत के तारों को न छुएं क्योंकि पानी विद्युत चालक है। बिजली के सॉकेट में कुछ भी न डालें। विद्युत उपकरणों के साथ हमेशा बड़ों से मदद मांगें। बिजली के झटके को रोकने के लिए तारों पर उचित इन्सुलेशन का उपयोग करें।" }
    ]
  },
  {
    "id": "sci_7_4",
    "grade": 7,
    "subject": "विज्ञान (Science)",
    "topic": "अम्ल, क्षार और लवण",
    "keywords": ["अम्ल", "क्षार", "संकेतक", "pH", "उदासीनीकरण"],
    "summary": "अम्ल और क्षार के गुण, संकेतक और उदासीनीकरण अभिक्रियाएं।",
    "pages": [
      { "title": "अम्ल क्या हैं?", "content": "अम्ल वे पदार्थ हैं जो खट्टे स्वाद के होते हैं और नीले लिटमस पेपर को लाल कर देते हैं। उदाहरणों में नींबू का रस (साइट्रिक अम्ल), सिरका (एसिटिक अम्ल), और पेट का अम्ल (हाइड्रोक्लोरिक अम्ल) शामिल हैं। तेज अम्ल संक्षारक होते हैं और त्वचा को जला सकते हैं।" },
      { "title": "क्षार क्या हैं?", "content": "क्षार वे पदार्थ हैं जो कड़वे स्वाद के होते हैं, छूने पर फिसलने वाले होते हैं और लाल लिटमस पेपर को नीला कर देते हैं। उदाहरणों में साबुन, बेकिंग सोडा (सोडियम बाइकार्बोनेट), और चूने का पानी शामिल हैं। कास्टिक सोडा जैसे तेज क्षार भी संक्षारक होते हैं।" },
      { "title": "संकेतक", "content": "संकेतक वे पदार्थ हैं जो अम्लीय और क्षारीय घोलों में अलग-अलग रंग दिखाते हैं। लिटमस एक प्राकृतिक संकेतक है जो लाइकेन से प्राप्त होता है। हल्दी, लाल पत्तागोभी का रस, और फिनोल्फ्थेलिन अन्य संकेतक हैं। pH स्केल 0-14 से अम्लता मापता है, जहां 7 उदासीन है।" },
      { "title": "उदासीनीकरण", "content": "जब एक अम्ल और एक क्षार एक साथ अभिक्रिया करते हैं, तो वे एक दूसरे को उदासीन करते हैं और लवण और पानी बनाते हैं। इसे उदासीनीकरण कहते हैं। उदाहरण: हाइड्रोक्लोरिक अम्ल और सोडियम हाइड्रॉक्साइड से सोडियम क्लोराइड (सामान्य नमक) और पानी बनता है। एंटासिड पेट के अतिरिक्त अम्ल को उदासीन करते हैं।" }
    ]
  },
  {
    "id": "sci_7_5",
    "grade": 7,
    "subject": "विज्ञान (Science)",
    "topic": "ऊष्मा और तापमान",
    "keywords": ["ऊष्मा", "तापमान", "थर्मामीटर", "चालन", "संवहन"],
    "summary": "ऊष्मा और तापमान में अंतर, ऊष्मा का स्थानांतरण और मापन।",
    "pages": [
      { "title": "ऊष्मा बनाम तापमान", "content": "ऊष्मा ऊर्जा का एक रूप है जो गर्म वस्तुओं से ठंडी वस्तुओं की ओर प्रवाहित होती है। तापमान यह मापता है कि कोई वस्तु कितनी गर्म या ठंडी है। तापमान थर्मामीटर का उपयोग करके डिग्री सेल्सियस (°C) या फारेनहाइट (°F) में मापा जाता है।" },
      { "title": "ऊष्मा का स्थानांतरण - चालन", "content": "चालन ठोस पदार्थों में सीधे संपर्क द्वारा ऊष्मा का स्थानांतरण है। जब आप धातु के चम्मच के एक सिरे को गर्म करते हैं, तो दूसरा सिरा भी गर्म हो जाता है। धातुएं ऊष्मा की अच्छी चालक हैं। लकड़ी और प्लास्टिक खराब चालक (कुचालक) हैं।" },
      { "title": "संवहन और विकिरण", "content": "संवहन तरल पदार्थों और गैसों में कणों की गति द्वारा ऊष्मा का स्थानांतरण है। गर्म पानी ऊपर उठता है जबकि ठंडा पानी नीचे डूबता है जिससे संवहन धाराएं बनती हैं। विकिरण बिना किसी माध्यम के ऊष्मा का स्थानांतरण है, जैसे सूर्य से पृथ्वी तक ऊष्मा पहुंचना।" },
      { "title": "ऊष्मा के प्रभाव", "content": "ऊष्मा ठोस, तरल और गैसों में प्रसार का कारण बनती है। रेलवे की पटरियों में गर्मियों में प्रसार की अनुमति के लिए अंतराल होते हैं। ऊष्मा पदार्थ की अवस्था बदल सकती है - बर्फ पानी में पिघलती है, पानी भाप में वाष्पित होता है। कुछ पदार्थ दूसरों की तुलना में ऊष्मा को बेहतर तरीके से चालन करते हैं।" }
    ]
  },
  {
    "id": "sci_8_3",
    "grade": 8,
    "subject": "विज्ञान (Science)",
    "topic": "ध्वनि और इसके गुण",
    "keywords": ["ध्वनि", "कंपन", "आवृत्ति", "आयाम", "प्रतिध्वनि"],
    "summary": "ध्वनि का उत्पादन, विशेषताएं और ध्वनि कैसे यात्रा करती है।",
    "pages": [
      { "title": "ध्वनि कैसे उत्पन्न होती है", "content": "ध्वनि कंपन करने वाली वस्तुओं द्वारा उत्पन्न होती है। जब कोई वस्तु कंपन करती है, तो यह आसपास की हवा में गड़बड़ी पैदा करती है जो ध्वनि तरंगों के रूप में यात्रा करती है। हम ध्वनि सुनते हैं जब ये कंपन हमारे कानों तक पहुंचते हैं। ध्वनि को यात्रा करने के लिए एक माध्यम (ठोस, तरल या गैस) की आवश्यकता होती है।" },
      { "title": "ध्वनि की विशेषताएं", "content": "तारत्व आवृत्ति पर निर्भर करता है - उच्च आवृत्ति का मतलब उच्च तारत्व (जैसे सीटी), कम आवृत्ति का मतलब कम तारत्व (जैसे ढोल)। प्रबलता आयाम पर निर्भर करती है - बड़े कंपन तेज ध्वनि उत्पन्न करते हैं। गुणवत्ता या टिंबर हमें विभिन्न ध्वनियों को अलग करने में मदद करती है।" },
      { "title": "ध्वनि की गति", "content": "ध्वनि विभिन्न माध्यमों में अलग-अलग गति से यात्रा करती है। यह ठोस में सबसे तेज (स्टील में लगभग 5000 m/s), तरल में धीमी (पानी में लगभग 1500 m/s), और गैसों में सबसे धीमी (हवा में लगभग 340 m/s) यात्रा करती है। ध्वनि निर्वात में यात्रा नहीं कर सकती।" },
      { "title": "प्रतिध्वनि और अनुप्रयोग", "content": "प्रतिध्वनि दीवार या पहाड़ जैसी कठोर सतह से ध्वनि का परावर्तन है। प्रतिध्वनि सुनने के लिए, परावर्तक सतह कम से कम 17 मीटर दूर होनी चाहिए। चमगादड़ और डॉल्फ़िन नेविगेट करने के लिए प्रतिध्वनि (इकोलोकेशन) का उपयोग करते हैं। SONAR समुद्र की गहराई मापने के लिए ध्वनि तरंगों का उपयोग करता है।" }
    ]
  },
  {
    "id": "sci_8_4",
    "grade": 8,
    "subject": "विज्ञान (Science)",
    "topic": "जंतुओं में जनन",
    "keywords": ["जनन", "अलैंगिक", "लैंगिक", "निषेचन", "भ्रूण"],
    "summary": "जनन के प्रकार, निषेचन और जंतुओं में विकास।",
    "pages": [
      { "title": "जनन क्यों?", "content": "जनन वह जैविक प्रक्रिया है जिसके द्वारा जीव संतान उत्पन्न करते हैं। यह प्रजातियों की निरंतरता सुनिश्चित करता है। दो प्रकार हैं: अलैंगिक जनन (एकल माता-पिता) और लैंगिक जनन (दो माता-पिता की आवश्यकता)।" },
      { "title": "अलैंगिक जनन", "content": "अलैंगिक जनन में, एक एकल जीव संभोग के बिना संतान उत्पन्न करता है। विधियों में मुकुलन (हाइड्रा में), द्विखंडन (अमीबा में), और पुनर्जनन (प्लेनेरिया में) शामिल हैं। संतान माता-पिता की सटीक प्रतियां होती हैं।" },
      { "title": "लैंगिक जनन", "content": "लैंगिक जनन में दो माता-पिता - नर और मादा शामिल होते हैं। नर शुक्राणु उत्पन्न करता है और मादा अंडे (डिंब) उत्पन्न करती है। जब एक शुक्राणु एक अंडे के साथ संलयन करता है, तो निषेचन होता है और एक युग्मनज बनता है। युग्मनज एक भ्रूण में विकसित होता है।" },
      { "title": "विकास के चरण", "content": "निषेचन के बाद, युग्मनज बार-बार विभाजित होकर एक भ्रूण बनाता है। जरायुज जंतुओं (जैसे मनुष्य, गाय) में, भ्रूण मां के शरीर के अंदर विकसित होता है। अंडप्रजक जंतुओं (जैसे पक्षी, मेंढक) में, भ्रूण बाहर रखे गए अंडे के अंदर विकसित होता है। बच्चा निकलता है या जन्म लेता है।" }
    ]
  },
  {
    "id": "sci_8_5",
    "grade": 8,
    "subject": "विज्ञान (Science)",
    "topic": "धातु और अधातु",
    "keywords": ["धातु", "अधातु", "गुण", "क्रियाशीलता", "मिश्र धातु"],
    "summary": "धातुओं और अधातुओं के भौतिक और रासायनिक गुण।",
    "pages": [
      { "title": "धातुओं के भौतिक गुण", "content": "धातुओं में चमक (चमक) होती है और ये ऊष्मा और विद्युत के अच्छे चालक होते हैं। वे आघातवर्ध्य (चादरों में पीटे जा सकते हैं) और तन्य (तारों में खींचे जा सकते हैं) होते हैं। अधिकांश धातुएं कमरे के तापमान पर ठोस होती हैं सिवाय पारे के जो तरल है। उदाहरण: लोहा, तांबा, एल्युमीनियम, सोना।" },
      { "title": "अधातुओं के भौतिक गुण", "content": "अधातुएं आम तौर पर निस्तेज (कोई चमक नहीं) होती हैं और ऊष्मा और विद्युत की खराब चालक होती हैं। वे भंगुर (आसानी से टूटती हैं) होती हैं और तारों में नहीं खींची जा सकतीं। अधातुएं कमरे के तापमान पर ठोस (सल्फर, कार्बन), तरल (ब्रोमीन), या गैस (ऑक्सीजन, नाइट्रोजन) हो सकती हैं।" },
      { "title": "रासायनिक गुण", "content": "धातुएं ऑक्सीजन के साथ अभिक्रिया करके धातु ऑक्साइड बनाती हैं जो क्षारीय प्रकृति के होते हैं। धातुएं अम्लों के साथ अभिक्रिया करके लवण और हाइड्रोजन गैस उत्पन्न करती हैं। अधातुएं ऑक्सीजन के साथ अभिक्रिया करके अधातु ऑक्साइड बनाती हैं जो अम्लीय प्रकृति के होते हैं। कुछ धातुएं दूसरों की तुलना में अधिक क्रियाशील होती हैं।" },
      { "title": "उपयोग और मिश्र धातुएं", "content": "धातुओं का उपयोग निर्माण, विद्युत वायरिंग, बर्तन बनाने और गहनों में किया जाता है। मिश्र धातुएं दो या अधिक धातुओं या एक धातु और एक अधातु का मिश्रण हैं। उदाहरण: इस्पात (लोहा + कार्बन), पीतल (तांबा + जस्ता), कांस्य (तांबा + टिन)। मिश्र धातुओं में अक्सर शुद्ध धातुओं से बेहतर गुण होते हैं।" }
    ]
  },
  {
    "id": "sci_8_6",
    "grade": 8,
    "subject": "विज्ञान (Science)",
    "topic": "कोशिका संरचना और कार्य",
    "keywords": ["कोशिका", "केंद्रक", "कोशिकाद्रव्य", "झिल्ली", "अंगक"],
    "summary": "कोशिकाओं की खोज, पादप और जंतु कोशिकाएं और उनके घटक।",
    "pages": [
      { "title": "कोशिका की खोज", "content": "रॉबर्ट हुक ने 1665 में माइक्रोस्कोप के नीचे कॉर्क के पतले टुकड़े को देखते हुए कोशिकाओं की खोज की। 'कोशिका' शब्द का अर्थ 'छोटा कमरा' है। बाद में, वैज्ञानिकों ने पाया कि सभी जीवित जीव कोशिकाओं से बने होते हैं। कोशिका जीवन की मूल संरचनात्मक और कार्यात्मक इकाई है।" },
      { "title": "कोशिका के भाग", "content": "प्रत्येक कोशिका में तीन मुख्य भाग होते हैं: कोशिका झिल्ली (बाहरी सीमा जो पदार्थों के प्रवेश और निकास को नियंत्रित करती है), कोशिकाद्रव्य (जेली जैसा पदार्थ जहां कोशिका गतिविधियां होती हैं), और केंद्रक (आनुवंशिक सामग्री DNA युक्त नियंत्रण केंद्र जो सभी कोशिका गतिविधियों को नियंत्रित करता है)।" },
      { "title": "पादप कोशिका बनाम जंतु कोशिका", "content": "पादप कोशिकाओं में कोशिका झिल्ली के बाहर एक कठोर कोशिका भित्ति, प्रकाश संश्लेषण के लिए हरितलवक, और भंडारण के लिए बड़ी रिक्तिकाएं होती हैं। जंतु कोशिकाओं में कोशिका भित्ति या हरितलवक नहीं होते, और छोटी रिक्तिकाएं होती हैं। दोनों में केंद्रक, कोशिकाद्रव्य और कोशिका झिल्ली होती है।" },
      { "title": "कोशिका अंगक", "content": "कोशिकाओं में छोटी संरचनाएं होती हैं जिन्हें अंगक कहते हैं। माइटोकॉन्ड्रिया ऊर्जा उत्पन्न करता है (कोशिका का पावरहाउस)। राइबोसोम प्रोटीन बनाते हैं। एंडोप्लाज्मिक रेटिकुलम सामग्री का परिवहन करता है। गॉल्जी बॉडी सामग्री को पैकेज करती है। लाइसोसोम अपशिष्ट को पचाते हैं। हरितलवक (पौधों में) प्रकाश संश्लेषण करते हैं।" }
    ]
  },
  {
    "id": "math_6_1",
    "grade": 6,
    "subject": "गणित (Math)",
    "topic": "पूर्ण संख्याएं और संक्रियाएं",
    "keywords": ["संख्या", "जोड़", "घटाव", "गुणा", "भाग"],
    "summary": "पूर्ण संख्याओं के गुण और चार मूल संक्रियाएं।",
    "pages": [
      { "title": "पूर्ण संख्याएं क्या हैं?", "content": "पूर्ण संख्याएं 0 से शुरू होकर अनंत तक जाने वाली संख्याओं का समूह है: 0, 1, 2, 3, 4, 5... इनमें सभी प्राकृतिक संख्याएं (गिनती की संख्याएं) और शून्य शामिल हैं। पूर्ण संख्याओं में ऋणात्मक संख्याएं, भिन्न या दशमलव शामिल नहीं हैं।" },
      { "title": "संक्रियाओं के गुण", "content": "क्रमविनिमेय गुण: a + b = b + a और a × b = b × a। साहचर्य गुण: (a + b) + c = a + (b + c)। तत्समक गुण: a + 0 = a और a × 1 = a। वितरण गुण: a × (b + c) = (a × b) + (a × c)।" },
      { "title": "गुणा और भाग", "content": "गुणा बार-बार जोड़ है। 4 × 3 का मतलब है 4 को 3 बार जोड़ना = 12। भाग बार-बार घटाव या गुणा का विलोम है। 12 ÷ 3 = 4 का मतलब है 12 में से 3 को कितनी बार घटाया जा सकता है। शून्य से भाग अपरिभाषित है।" },
      { "title": "संक्रियाओं का क्रम", "content": "जब कई संक्रियाओं वाली व्यंजकों को हल करते हैं, तो BODMAS नियम का पालन करें: पहले कोष्ठक (Brackets), फिर घात (Orders), फिर भाग और गुणा (बाएं से दाएं), फिर जोड़ और घटाव (बाएं से दाएं)। उदाहरण: 2 + 3 × 4 = 2 + 12 = 14, न कि 20।" }
    ]
  },
  {
    "id": "math_6_2",
    "grade": 6,
    "subject": "गणित (Math)",
    "topic": "भिन्न और दशमलव",
    "keywords": ["भिन्न", "दशमलव", "अंश", "हर", "रूपांतरण"],
    "summary": "भिन्न, दशमलव और उनके रूपांतरण को समझना।",
    "pages": [
      { "title": "भिन्न क्या है?", "content": "एक भिन्न एक पूर्ण के भाग को दर्शाती है। इसके दो भाग होते हैं: अंश (ऊपर की संख्या, लिए गए भाग) और हर (नीचे की संख्या, कुल भाग)। उदाहरण: 3/4 का मतलब है 4 समान भागों में से 3 भाग। प्रकारों में उचित, अनुचित और मिश्रित भिन्न शामिल हैं।" },
      { "title": "भिन्नों के साथ संक्रियाएं", "content": "भिन्नों को जोड़ने या घटाने के लिए, हर समान बनाएं (LCM विधि)। उदाहरण: 1/2 + 1/3 = 3/6 + 2/6 = 5/6। भिन्नों को गुणा करने के लिए, अंश और हर को अलग-अलग गुणा करें। भिन्नों को विभाजित करने के लिए, दूसरी भिन्न के व्युत्क्रम से गुणा करें।" },
      { "title": "दशमलव", "content": "दशमलव भिन्नों को दर्शाने का एक और तरीका है जिनके हर 10, 100, 1000 आदि हैं। एक दशमलव बिंदु पूर्ण भाग को भिन्नात्मक भाग से अलग करता है। उदाहरण: 3.5 का मतलब है 3 पूर्ण और 5 दशांश। स्थानीय मान: दशांश, शतांश, सहस्रांश।" },
      { "title": "रूपों के बीच रूपांतरण", "content": "भिन्न को दशमलव में बदलने के लिए, अंश को हर से विभाजित करें। उदाहरण: 1/4 = 0.25। दशमलव को भिन्न में बदलने के लिए, दशमलव स्थानों की गिनती करें और भिन्न के रूप में लिखें। उदाहरण: 0.75 = 75/100 = 3/4 (सरलीकृत)। प्रतिशत को भी भिन्न और दशमलव के रूप में व्यक्त किया जा सकता है।" }
    ]
  },
  {
    "id": "math_6_3",
    "grade": 6,
    "subject": "गणित (Math)",
    "topic": "पूर्णांक",
    "keywords": ["पूर्णांक", "धनात्मक", "ऋणात्मक", "संख्या रेखा", "निरपेक्ष"],
    "summary": "धनात्मक और ऋणात्मक संख्याओं का परिचय और पूर्णांकों पर संक्रियाएं।",
    "pages": [
      { "title": "पूर्णांक क्या हैं?", "content": "पूर्णांकों में सभी पूर्ण संख्याएं और उनकी ऋणात्मक संख्याएं शामिल हैं: ...-3, -2, -1, 0, 1, 2, 3... धनात्मक पूर्णांक शून्य से बड़े होते हैं, ऋणात्मक पूर्णांक शून्य से छोटे होते हैं। शून्य न तो धनात्मक है और न ही ऋणात्मक। हम पूर्णांकों का उपयोग तापमान, बैंक शेष, ऊंचाई दर्शाने के लिए करते हैं।" },
      { "title": "संख्या रेखा और तुलना", "content": "संख्या रेखा पर, धनात्मक संख्याएं शून्य के दाईं ओर होती हैं, ऋणात्मक संख्याएं बाईं ओर होती हैं। जैसे-जैसे हम दाईं ओर बढ़ते हैं संख्याएं बढ़ती हैं। तुलना करने के लिए: कोई भी धनात्मक संख्या किसी भी ऋणात्मक संख्या से बड़ी होती है। ऋणात्मक संख्याओं में, शून्य के करीब वाली बड़ी होती है। उदाहरण: -2 > -5।" },
      { "title": "जोड़ और घटाव", "content": "समान चिह्न वाले पूर्णांकों को जोड़ने के लिए, उनके निरपेक्ष मानों को जोड़ें और चिह्न रखें। विभिन्न चिह्नों के लिए, निरपेक्ष मानों को घटाएं और बड़ी संख्या का चिह्न लें। घटाव: घटाई जाने वाली संख्या का चिह्न बदलें और जोड़ें। उदाहरण: 5 - 8 = 5 + (-8) = -3।" },
      { "title": "गुणा और भाग", "content": "नियम: धनात्मक × धनात्मक = धनात्मक। ऋणात्मक × ऋणात्मक = धनात्मक। धनात्मक × ऋणात्मक = ऋणात्मक। वही नियम भाग के लिए लागू होते हैं। उदाहरण: (-3) × (-4) = 12, लेकिन (-3) × 4 = -12। निरपेक्ष मान शून्य से दूरी है, हमेशा धनात्मक: |-5| = 5।" }
    ]
  },
  {
    "id": "math_7_2",
    "grade": 7,
    "subject": "गणित (Math)",
    "topic": "प्रतिशत और लाभ-हानि",
    "keywords": ["प्रतिशत", "लाभ", "हानि", "छूट", "ब्याज"],
    "summary": "प्रतिशत, लाभ, हानि और सरल अनुप्रयोगों की गणना।",
    "pages": [
      { "title": "प्रतिशत को समझना", "content": "प्रतिशत का मतलब है 'प्रति सौ'। 25% का मतलब है 100 में से 25। भिन्न को प्रतिशत में बदलने के लिए, 100 से गुणा करें। उदाहरण: 1/4 = (1/4) × 100 = 25%। प्रतिशत को भिन्न में बदलने के लिए, 100 से विभाजित करें। उदाहरण: 30% = 30/100 = 3/10।" },
      { "title": "प्रतिशत ज्ञात करना", "content": "किसी संख्या का प्रतिशत ज्ञात करने के लिए: (प्रतिशत/100) × संख्या। उदाहरण: 500 का 20% = (20/100) × 500 = 100। एक संख्या दूसरी संख्या का कितना प्रतिशत है यह ज्ञात करने के लिए: (भाग/पूर्ण) × 100। उदाहरण: 15, 60 का कितना % है? (15/60) × 100 = 25%।" },
      { "title": "लाभ और हानि", "content": "लागत मूल्य (CP) वह कीमत है जिस पर कोई वस्तु खरीदी जाती है। विक्रय मूल्य (SP) वह कीमत है जिस पर उसे बेचा जाता है। लाभ = SP - CP (जब SP > CP)। हानि = CP - SP (जब CP > SP)। लाभ% = (लाभ/CP) × 100। हानि% = (हानि/CP) × 100।" },
      { "title": "छूट और कर", "content": "छूट अंकित मूल्य (MP) में कमी है। छूट = MP - SP। छूट% = (छूट/MP) × 100। बिक्री कर या GST कीमत में जोड़ा जाता है। अंतिम मूल्य = SP + कर। कर राशि = (कर%/100) × SP। उदाहरण: यदि MP ₹1000 है और छूट 20% है, तो SP = 1000 - 200 = ₹800।" }
    ]
  },
  {
    "id": "math_7_3",
    "grade": 7,
    "subject": "गणित (Math)",
    "topic": "सरल समीकरण",
    "keywords": ["समीकरण", "चर", "व्यंजक", "हल", "रैखिक"],
    "summary": "चर को समझना, सरल रैखिक समीकरण बनाना और हल करना।",
    "pages": [
      { "title": "चर और व्यंजक", "content": "एक चर एक प्रतीक (आमतौर पर x, y जैसा अक्षर) है जो एक अज्ञात संख्या का प्रतिनिधित्व करता है। एक बीजीय व्यंजक संक्रियाओं का उपयोग करके चर और स्थिरांक को जोड़ता है। उदाहरण: 2x + 5, 3y - 7, 4a + 2b। स्थिरांक निश्चित मान हैं जैसे 5, -3, 10।" },
      { "title": "समीकरण क्या है?", "content": "एक समीकरण एक कथन है कि दो व्यंजक बराबर हैं, '=' चिह्न से जुड़े हुए। उदाहरण: 2x + 3 = 9। चर का वह मान जो समीकरण को सत्य बनाता है उसे हल कहते हैं। LHS (बायां पक्ष) और RHS (दायां पक्ष) बराबर होने चाहिए।" },
      { "title": "सरल समीकरण हल करना", "content": "समीकरण को हल करने के लिए, चर को एक तरफ अलग करें। नियम: दोनों पक्षों में एक ही संख्या जोड़ी/घटाई जा सकती है। दोनों पक्षों को एक ही गैर-शून्य संख्या से गुणा/विभाजित किया जा सकता है। उदाहरण: 2x + 3 = 9। 3 घटाएं: 2x = 6। 2 से विभाजित करें: x = 3।" },
      { "title": "शब्द समस्याएं", "content": "शब्द समस्याओं को हल करने के चरण: 1) ध्यान से पढ़ें और अज्ञात की पहचान करें। 2) अज्ञात के लिए चर निर्धारित करें। 3) दी गई जानकारी से समीकरण बनाएं। 4) समीकरण हल करें। 5) जांचें कि उत्तर समझदार है। उदाहरण: दो क्रमागत संख्याओं का योग 15 है। यदि पहली x है, तो x + (x+1) = 15, तो 2x = 14, x = 7।" }
    ]
  },
  {
    "id": "math_7_4",
    "grade": 7,
    "subject": "गणित (Math)",
    "topic": "परिमाप और क्षेत्रफल",
    "keywords": ["परिमाप", "क्षेत्रफल", "आयत", "त्रिभुज", "वृत्त"],
    "summary": "विभिन्न समतल आकृतियों का परिमाप और क्षेत्रफल की गणना।",
    "pages": [
      { "title": "आकृतियों का परिमाप", "content": "परिमाप एक बंद आकृति के चारों ओर की कुल दूरी है। आयत: P = 2(लंबाई + चौड़ाई)। वर्ग: P = 4 × भुजा। त्रिभुज: P = तीनों भुजाओं का योग। वृत्त: परिमाप को परिधि कहते हैं = 2πr, जहां r त्रिज्या है और π ≈ 3.14 या 22/7।" },
      { "title": "मूल आकृतियों का क्षेत्रफल", "content": "क्षेत्रफल एक सीमा के भीतर घिरी सतह की मात्रा है, वर्ग इकाइयों में मापा जाता है। आयत: A = लंबाई × चौड़ाई। वर्ग: A = भुजा × भुजा। त्रिभुज: A = (1/2) × आधार × ऊंचाई। समांतर चतुर्भुज: A = आधार × ऊंचाई। वृत्त: A = πr²।" },
      { "title": "माप की इकाइयां", "content": "परिमाप रैखिक इकाइयों में मापा जाता है: cm, m, km। क्षेत्रफल वर्ग इकाइयों में मापा जाता है: cm², m², km²। रूपांतरण: 1 m = 100 cm, तो 1 m² = 100 cm × 100 cm = 10,000 cm²। हेक्टेयर के लिए: 1 हेक्टेयर = 10,000 m²। हमेशा एक समस्या में एक ही इकाइयों का उपयोग करें।" },
      { "title": "व्यावहारिक अनुप्रयोग", "content": "परिमाप बगीचे के लिए आवश्यक बाड़ या चित्र फ्रेम के लिए सीमा ज्ञात करने में मदद करता है। क्षेत्रफल कमरे के लिए आवश्यक कालीन, दीवार के लिए पेंट, या भूमि माप ज्ञात करने में मदद करता है। उदाहरण: एक आयताकार मैदान 50m × 30m है। परिमाप = 2(50+30) = 160m। क्षेत्रफल = 50 × 30 = 1500 m²।" }
    ]
  },
  {
    "id": "math_8_2",
    "grade": 8,
    "subject": "गणित (Math)",
    "topic": "घातांक और घात",
    "keywords": ["घातांक", "घात", "आधार", "सूचकांक", "वैज्ञानिक संकेतन"],
    "summary": "घातांक के नियम और मानक रूप में बड़ी संख्याओं को व्यक्त करना।",
    "pages": [
      { "title": "घातांक को समझना", "content": "जब किसी संख्या को खुद से बार-बार गुणा किया जाता है, तो हम घातांकीय रूप का उपयोग करते हैं। उदाहरण: 2 × 2 × 2 × 2 = 2⁴ = 16। यहां, 2 आधार है और 4 घातांक या घात है। '2 की घात 4' या '2 को 4 तक बढ़ाया' के रूप में पढ़ा जाता है। किसी भी संख्या की घात 1 खुद होती है: a¹ = a।" },
      { "title": "घातांक के नियम", "content": "गुणनफल नियम: aᵐ × aⁿ = aᵐ⁺ⁿ। भागफल नियम: aᵐ ÷ aⁿ = aᵐ⁻ⁿ। घात की घात: (aᵐ)ⁿ = aᵐⁿ। गुणनफल की घात: (ab)ᵐ = aᵐbᵐ। शून्य घातांक: a⁰ = 1 (a ≠ 0)। ऋणात्मक घातांक: a⁻ᵐ = 1/aᵐ।" },
      { "title": "वैज्ञानिक संकेतन", "content": "बहुत बड़ी या बहुत छोटी संख्याओं को वैज्ञानिक संकेतन या मानक रूप में व्यक्त किया जा सकता है: a × 10ⁿ, जहां 1 ≤ a < 10 और n एक पूर्णांक है। उदाहरण: 45,000 = 4.5 × 10⁴। उदाहरण: 0.00067 = 6.7 × 10⁻⁴। यह गणना को आसान बनाता है।" },
      { "title": "अनुप्रयोग और उदाहरण", "content": "सरल करें: (2³)² × 2⁴ = 2⁶ × 2⁴ = 2¹⁰ = 1024। सरल करें: (3² × 3⁵) ÷ 3⁴ = 3⁷ ÷ 3⁴ = 3³ = 27। पृथ्वी से सूर्य की दूरी लगभग 150,000,000 km = 1.5 × 10⁸ km है। घातांकों का उपयोग खगोलीय दूरियों, सूक्ष्म आकारों और चक्रवृद्धि ब्याज की गणना में किया जाता है।" }
    ]
  },
  {
    "id": "math_8_3",
    "grade": 8,
    "subject": "गणित (Math)",
    "topic": "एक चर में रैखिक समीकरण",
    "keywords": ["रैखिक", "समीकरण", "चर", "पक्षांतरण", "हल"],
    "summary": "पक्षांतरण विधि का उपयोग करके जटिल रैखिक समीकरणों को हल करना।",
    "pages": [
      { "title": "रैखिक समीकरण", "content": "एक चर में एक रैखिक समीकरण ax + b = c के रूप का समीकरण है, जहां a, b, c स्थिरांक हैं और a ≠ 0। चर की उच्चतम घात 1 है। उदाहरण: 3x + 5 = 14, (2x/3) - 7 = 1। इन समीकरणों का ठीक एक हल होता है।" },
      { "title": "पक्षांतरण विधि", "content": "पक्षांतरण का मतलब है किसी पद को समीकरण के एक पक्ष से दूसरे पक्ष में उसका चिह्न बदलकर ले जाना। जोड़ना घटाना बन जाता है और इसके विपरीत। गुणा करना विभाजन बन जाता है और इसके विपरीत। उदाहरण: 3x + 5 = 14। +5 को दाएं पक्ष में ले जाएं: 3x = 14 - 5 = 9। ×3 को पक्षांतरित करें: x = 9/3 = 3।" },
      { "title": "भिन्नों वाले समीकरण", "content": "भिन्नों वाले समीकरणों को हल करने के लिए, पहले हरों का LCM ज्ञात करें और दोनों पक्षों को इससे गुणा करके भिन्नों को हटाएं। उदाहरण: x/2 + x/3 = 10। 2,3 का LCM 6 है। दोनों पक्षों को 6 से गुणा करें: 3x + 2x = 60। तो 5x = 60, x = 12। हमेशा वापस प्रतिस्थापित करके हल सत्यापित करें।" },
      { "title": "शब्द समस्याओं को समीकरण में", "content": "शब्द समस्याओं को समीकरणों में अनुवाद करें। मुख्य शब्द: 'योग' का मतलब +, 'अंतर' का मतलब -, 'गुणनफल' का मतलब ×, 'है/बराबर' का मतलब =। उदाहरण: किसी संख्या का तीन गुना 5 से बढ़ाने पर 26 के बराबर होता है। संख्या को x मानें। समीकरण: 3x + 5 = 26। हल: 3x = 21, x = 7।" }
    ]
  },
  {
    "id": "math_8_4",
    "grade": 8,
    "subject": "गणित (Math)",
    "topic": "वर्ग और वर्गमूल",
    "keywords": ["वर्ग", "मूल", "पूर्ण वर्ग", "पाइथागोरस", "घन"],
    "summary": "पूर्ण वर्गों के गुण और वर्गमूल ज्ञात करने की विधियां।",
    "pages": [
      { "title": "वर्ग संख्याएं", "content": "जब किसी संख्या को खुद से गुणा किया जाता है, तो गुणनफल को उसका वर्ग कहते हैं। उदाहरण: 5² = 5 × 5 = 25। 1, 4, 9, 16, 25, 36... जैसी संख्याएं पूर्ण वर्ग हैं। विषम संख्या का वर्ग विषम होता है, सम संख्या का वर्ग सम होता है। पहली n विषम संख्याओं का योग = n²।" },
      { "title": "वर्गों के गुण", "content": "2, 3, 7, या 8 में समाप्त होने वाली संख्या पूर्ण वर्ग नहीं हो सकती। वर्ग केवल 0, 1, 4, 5, 6, या 9 में समाप्त होते हैं। n² और (n+1)² के बीच, 2n गैर-पूर्ण वर्ग संख्याएं होती हैं। उदाहरण: 4² = 16 और 5² = 25 के बीच, 2(4) = 8 संख्याएं हैं।" },
      { "title": "वर्गमूल", "content": "वर्गमूल वर्ग करने की विपरीत संक्रिया है। यदि x² = y है, तो x, y का वर्गमूल है, √y के रूप में लिखा जाता है। उदाहरण: √25 = 5 क्योंकि 5² = 25। पूर्ण वर्ग का वर्गमूल हमेशा एक पूर्ण संख्या होता है। वर्गमूल ज्ञात करने की विधियां: अभाज्य गुणनखंडन, लंबी विभाजन विधि।" },
      { "title": "वर्गमूल ज्ञात करना", "content": "अभाज्य गुणनखंडन विधि: संख्या को जोड़ों में अभाज्य गुणनखंडों के गुणनफल के रूप में व्यक्त करें। उदाहरण: √144 = √(2×2×2×2×3×3) = 2×2×3 = 12। लंबी विभाजन विधि बड़ी संख्याओं के लिए उपयोग की जाती है। दशमलव का वर्गमूल दशमलव हटाकर और उत्तर में उचित रूप से बहाल करके ज्ञात किया जा सकता है।" }
    ]
  },
  {
    "id": "math_8_5",
    "grade": 8,
    "subject": "गणित (Math)",
    "topic": "आंकड़ों का प्रबंधन",
    "keywords": ["आंकड़े", "सांख्यिकी", "ग्राफ", "माध्य", "माध्यिका", "बहुलक"],
    "summary": "आंकड़ों का संग्रह और प्रतिनिधित्व, केंद्रीय प्रवृत्ति के माप।",
    "pages": [
      { "title": "आंकड़ों को व्यवस्थित करना", "content": "आंकड़े किसी उद्देश्य के लिए एकत्रित की गई जानकारी हैं। कच्चे आंकड़े अव्यवस्थित होते हैं। हम आंकड़ों को बारंबारता तालिका में व्यवस्थित करते हैं जो दिखाती है कि प्रत्येक मान कितनी बार आता है। उदाहरण: 10 छात्रों के अंक: 45, 50, 45, 60, 50, 45, 70, 50, 60, 45। बारंबारता तालिका दिखाती है कि 45, 4 बार आता है, 50, 3 बार आता है, आदि।" },
      { "title": "चित्रमय प्रतिनिधित्व", "content": "आंकड़ों को ग्राफ का उपयोग करके दृश्य रूप से दिखाया जा सकता है। दंड आरेख समान चौड़ाई लेकिन अलग-अलग ऊंचाइयों की आयताकार पट्टियों का उपयोग करता है। हिस्टोग्राम समान है लेकिन सतत आंकड़ों के लिए। पाई चार्ट आंकड़ों को वृत्त के त्रिज्यखंडों के रूप में दिखाता है जहां प्रत्येक त्रिज्यखंड एक अनुपात का प्रतिनिधित्व करता है। रेखा ग्राफ समय के साथ प्रवृत्तियां दिखाता है।" },
      { "title": "माध्य, माध्यिका, बहुलक", "content": "माध्य (औसत) = सभी प्रेक्षणों का योग ÷ प्रेक्षणों की संख्या। माध्यिका क्रम में व्यवस्थित करने पर मध्य मान है। सम संख्या के मानों के लिए, माध्यिका = दो मध्य मानों का औसत। बहुलक वह मान है जो सबसे अधिक बार आता है। एक आंकड़ा समूह में कोई बहुलक नहीं, एक बहुलक, या कई बहुलक हो सकते हैं।" },
      { "title": "परास और अनुप्रयोग", "content": "परास = उच्चतम मान - निम्नतम मान। यह आंकड़ों का प्रसार दिखाता है। उदाहरण: परीक्षा के अंक 45, 50, 55, 60, 65। माध्य = (45+50+55+60+65)÷5 = 55। माध्यिका = 55 (मध्य मान)। कोई बहुलक नहीं (सभी मान एक बार आते हैं)। परास = 65-45 = 20। ये माप प्रदर्शन, प्रवृत्तियों का विश्लेषण करने और तुलना करने में मदद करते हैं।" }
    ]
  },
  {
    "id": "math_8_6",
    "grade": 8,
    "subject": "गणित (Math)",
    "topic": "क्षेत्रमिति: क्षेत्रफल और आयतन",
    "keywords": ["क्षेत्रफल", "आयतन", "घनाभ", "बेलन", "पृष्ठीय क्षेत्रफल"],
    "summary": "3D आकृतियों का पृष्ठीय क्षेत्रफल और आयतन की गणना।",
    "pages": [
      { "title": "त्रि-आयामी आकृतियां", "content": "3D आकृतियों में लंबाई, चौड़ाई और ऊंचाई होती है। सामान्य आकृतियां: घन (सभी किनारे समान), घनाभ (आयताकार बॉक्स), बेलन (गोलाकार आधार और शीर्ष), शंकु (नुकीले शीर्ष के साथ गोलाकार आधार), गोला (गेंद की तरह पूरी तरह से गोल)। आयतन घेरा गया स्थान है, घन इकाइयों में मापा जाता है।" },
      { "title": "घनाभ और घन", "content": "घनाभ: आयतन = लंबाई × चौड़ाई × ऊंचाई। कुल पृष्ठीय क्षेत्रफल = 2(lb + bh + lh)। पार्श्व पृष्ठीय क्षेत्रफल = 2h(l + b)। घन सभी भुजाओं के समान होने वाला विशेष घनाभ है। घन: आयतन = भुजा³। कुल पृष्ठीय क्षेत्रफल = 6 × भुजा²। उदाहरण: 5cm भुजा के घन का आयतन = 125 cm³।" },
      { "title": "बेलन", "content": "बेलन में वक्र सतह से जुड़े दो गोलाकार आधार होते हैं। आयतन = πr²h, जहां r त्रिज्या है और h ऊंचाई है। वक्र पृष्ठीय क्षेत्रफल = 2πrh। कुल पृष्ठीय क्षेत्रफल = 2πrh + 2πr² = 2πr(h + r)। उदाहरण: r=7cm, h=10cm वाले बेलन का आयतन = (22/7)×7×7×10 = 1540 cm³।" },
      { "title": "व्यावहारिक अनुप्रयोग", "content": "आयतन पात्रों, टैंकों, जल भंडारण की क्षमता ज्ञात करने में मदद करता है। पृष्ठीय क्षेत्रफल पैकेजिंग, पेंटिंग या ढकने के लिए आवश्यक सामग्री की गणना में मदद करता है। उदाहरण: बेलनाकार टैंक में पानी ज्ञात करने के लिए, आयतन की गणना करें। कमरे (घनाभ) की दीवारों के लिए आवश्यक पेंट ज्ञात करने के लिए, फर्श और छत को छोड़कर पार्श्व पृष्ठीय क्षेत्रफल की गणना करें।" }
    ]
  },
  {
    "id": "comp_6_1",
    "grade": 6,
    "subject": "कंप्यूटर (Computer)",
    "topic": "Microsoft Word मूल बातें",
    "keywords": ["वर्ड", "टाइपिंग", "फ़ॉर्मेटिंग", "दस्तावेज़", "संपादन"],
    "summary": "MS Word में दस्तावेज़ बनाना और फ़ॉर्मेट करना।",
    "pages": [
      { "title": "MS Word का परिचय", "content": "Microsoft Word एक वर्ड प्रोसेसिंग सॉफ्टवेयर है जिसका उपयोग पत्र, रिपोर्ट और असाइनमेंट जैसे टेक्स्ट दस्तावेज़ बनाने के लिए किया जाता है। आप दस्तावेज़ों को टाइप, संपादित, फ़ॉर्मेट और प्रिंट कर सकते हैं। मुख्य भाग: शीर्षक पट्टी (दस्तावेज़ का नाम दिखाती है), मेनू बार/रिबन (उपकरण शामिल हैं), कार्यक्षेत्र (जहां आप टाइप करते हैं), स्क्रॉल बार (ऊपर/नीचे जाने के लिए)।" },
      { "title": "बनाना और सहेजना", "content": "नया दस्तावेज़ बनाने के लिए: File → New पर क्लिक करें या Ctrl+N दबाएं। कार्यक्षेत्र में अपनी सामग्री टाइप करें। सहेजने के लिए: File → Save पर क्लिक करें या Ctrl+S दबाएं। स्थान चुनें, फ़ाइल नाम दें, Save पर क्लिक करें। फ़ाइल को .docx एक्सटेंशन मिलता है। काम खोने से बचने के लिए नियमित रूप से सहेजें। Save As अलग नाम या स्थान के साथ एक प्रति बनाता है।" },
      { "title": "बुनियादी फ़ॉर्मेटिंग", "content": "पहले टेक्स्ट चुनें, फिर फ़ॉर्मेटिंग लागू करें। फ़ॉन्ट: Home टैब से प्रकार, आकार, रंग बदलें। जोर देने के लिए Bold (Ctrl+B), Italic (Ctrl+I), Underline (Ctrl+U)। संरेखण: Left, Center, Right, Justify बटन। पंक्ति रिक्ति पंक्तियों के बीच अंतराल को नियंत्रित करती है। बुलेट और नंबरिंग सूचियां बनाते हैं।" },
      { "title": "संपादन उपकरण", "content": "Cut (Ctrl+X), Copy (Ctrl+C), Paste (Ctrl+V) टेक्स्ट को स्थानांतरित या दोहराने के लिए। Undo (Ctrl+Z) अंतिम क्रिया को उलट देता है, Redo (Ctrl+Y) इसे पुनर्स्थापित करता है। Find (Ctrl+F) टेक्स्ट खोजता है। Replace (Ctrl+H) दस्तावेज़ भर में टेक्स्ट बदलता है। Spell Check लाल रेखांकन के साथ वर्तनी की गलतियों की पहचान करता है। व्याकरण त्रुटियां नीली रेखा के साथ दिखाई जाती हैं।" }
    ]
  },
  {
    "id": "comp_6_2",
    "grade": 6,
    "subject": "कंप्यूटर (Computer)",
    "topic": "ऑपरेटिंग सिस्टम मूल बातें",
    "keywords": ["विंडोज", "OS", "फ़ाइल", "फ़ोल्डर", "डेस्कटॉप"],
    "summary": "ऑपरेटिंग सिस्टम और फ़ाइल प्रबंधन को समझना।",
    "pages": [
      { "title": "ऑपरेटिंग सिस्टम क्या है?", "content": "ऑपरेटिंग सिस्टम (OS) सिस्टम सॉफ्टवेयर है जो कंप्यूटर हार्डवेयर और सॉफ्टवेयर का प्रबंधन करता है। यह उपयोगकर्ता और कंप्यूटर के बीच इंटरफ़ेस के रूप में कार्य करता है। सामान्य OS: Windows, macOS, Linux, Android, iOS। OS मेमोरी का प्रबंधन करता है, परिधीयों को नियंत्रित करता है, एप्लिकेशन चलाता है, और उपयोगकर्ता इंटरफ़ेस प्रदान करता है।" },
      { "title": "डेस्कटॉप और आइकन", "content": "डेस्कटॉप मुख्य स्क्रीन है जो आप कंप्यूटर शुरू करने के बाद देखते हैं। आइकन छोटे चित्र हैं जो फ़ाइलों, फ़ोल्डरों या प्रोग्रामों का प्रतिनिधित्व करते हैं। महत्वपूर्ण आइकन: My Computer/This PC (ड्राइव एक्सेस), Recycle Bin (हटाई गई फ़ाइलें संग्रहीत करता है), Taskbar (नीचे, चल रहे प्रोग्राम दिखाता है), Start Menu (सभी प्रोग्रामों और सेटिंग्स तक पहुंच)।" },
      { "title": "फ़ाइलें और फ़ोल्डर", "content": "फ़ाइल एक नाम के साथ संग्रहीत डेटा का संग्रह है। प्रकार: दस्तावेज़ फ़ाइलें (.docx, .pdf), छवि फ़ाइलें (.jpg, .png), वीडियो फ़ाइलें (.mp4), ऑडियो फ़ाइलें (.mp3)। फ़ोल्डर (डायरेक्टरी) फ़ाइलों को व्यवस्थित करने के लिए एक कंटेनर है। आप बेहतर व्यवस्थित करने के लिए फ़ोल्डरों के अंदर फ़ोल्डर (उपफ़ोल्डर) बना सकते हैं।" },
      { "title": "फ़ाइल प्रबंधन", "content": "फ़ोल्डर बनाने के लिए: Right-click → New → Folder। इसे एक नाम दें। फ़ाइल कॉपी करें: Right-click → Copy, फिर गंतव्य में Paste। फ़ाइल स्थानांतरित करें: Cut और Paste या drag और drop। फ़ाइल हटाएं: चुनें और Delete कुंजी दबाएं (Recycle Bin में जाती है)। Empty Recycle Bin फ़ाइलों को स्थायी रूप से हटा देता है। Search बार फ़ाइलें जल्दी खोजने में मदद करता है।" }
    ]
  },
  {
    "id": "comp_6_3",
    "grade": 6,
    "subject": "कंप्यूटर (Computer)",
    "topic": "पेंट और ड्राइंग",
    "keywords": ["पेंट", "ड्राइंग", "उपकरण", "रंग", "आकृतियां"],
    "summary": "Microsoft Paint का उपयोग करके डिजिटल ड्राइंग बनाना।",
    "pages": [
      { "title": "MS Paint का परिचय", "content": "Microsoft Paint चित्र बनाने और संपादित करने के लिए एक साधारण ग्राफिक्स प्रोग्राम है। ड्राइंग, रंग भरने और बुनियादी छवि संपादन के लिए उपयोग किया जाता है। मुख्य उपकरण: Pencil (फ्रीहैंड ड्राइंग), Brush (मोटी लाइनें), Eraser (भागों को हटाता है), Fill (क्षेत्रों को रंग देता है), Text (शब्द जोड़ता है), Shapes (ज्यामितीय आकृतियां खींचता है)।" },
      { "title": "ड्राइंग उपकरण", "content": "Pencil उपकरण पतली रेखाएं खींचता है। Brush की अलग-अलग शैलियां और आकार होते हैं। Line उपकरण सीधी रेखाएं खींचता है। Curve उपकरण वक्र रेखाएं बनाता है। Color Palette (नीचे) से रंग चुनें। Left-click अग्रभूमि रंग चुनता है, right-click पृष्ठभूमि रंग चुनता है। Size स्लाइडर उपकरण की मोटाई बदलता है।" },
      { "title": "आकृतियां और भरना", "content": "Shapes मेनू में आयत, वृत्त, त्रिभुज, बहुभुज आदि हैं। आकृति पर क्लिक करें, फिर कैनवास पर drag करें। Outline रंग अग्रभूमि रंग है। बंद क्षेत्र के अंदर क्लिक करके Paint Bucket उपकरण से भरें। रंगीन डिजाइन बनाने के लिए विभिन्न रंगों का उपयोग करें। Eyedropper उपकरण मौजूदा छवि से रंग चुनता है।" },
      { "title": "संपादन और सहेजना", "content": "Select उपकरण आयताकार क्षेत्र चुनता है। Free-form select अनियमित आकार चुनता है। चयनित क्षेत्रों के साथ Cut, Copy, Paste काम करते हैं। Image मेनू में Rotate/Flip विकल्प। Resize छवि आयाम बदलता है। सहेजने के लिए: File → Save। JPEG (फ़ोटो) या PNG (पारदर्शिता वाली ड्राइंग) चुनें। BMP असंपीड़ित प्रारूप है।" }
    ]
  },
  {
    "id": "comp_7_2",
    "grade": 7,
    "subject": "कंप्यूटर (Computer)",
    "topic": "Microsoft Excel मूल बातें",
    "keywords": ["एक्सेल", "स्प्रेडशीट", "सूत्र", "सेल", "चार्ट"],
    "summary": "स्प्रेडशीट बनाना और MS Excel में गणना करना।",
    "pages": [
      { "title": "Excel का परिचय", "content": "Microsoft Excel एक स्प्रेडशीट प्रोग्राम है जिसका उपयोग गणना, डेटा विश्लेषण और चार्ट बनाने के लिए किया जाता है। वर्कशीट में पंक्तियां (1,2,3... से नंबर) और स्तंभ (A,B,C... से लेबल) होते हैं। पंक्ति और स्तंभ का प्रतिच्छेदन Cell (जैसे A1, B5) कहलाता है। सक्रिय सेल में गहरी सीमा होती है। सेल पता प्रत्येक सेल को विशिष्ट रूप से पहचानता है।" },
      { "title": "डेटा दर्ज करना और संपादित करना", "content": "सेल पर क्लिक करें और दर्ज करने के लिए टाइप करें। नीचे अगले सेल में जाने के लिए Enter दबाएं, दाएं अगले सेल के लिए Tab। डेटा के प्रकार: Text (नाम, लेबल), Numbers (गणना के लिए), Dates। संपादित करने के लिए: सेल पर डबल-क्लिक करें या F2 दबाएं। स्तंभ की चौड़ाई स्तंभ सीमा को drag करके समायोजित की जा सकती है। AutoFill: पैटर्न को कॉपी या जारी रखने के लिए fill handle को drag करें।" },
      { "title": "सूत्र और फ़ंक्शन", "content": "सूत्र = चिह्न से शुरू होता है और गणना करता है। उदाहरण: =A1+B1, सेल A1 और B1 में मानों को जोड़ता है। मूल ऑपरेटर: + (जोड़), - (घटाव), * (गुणा), / (भाग)। फ़ंक्शन: SUM (रेंज जोड़ता है), AVERAGE (माध्य ज्ञात करता है), MAX (सबसे बड़ा मान), MIN (सबसे छोटा मान)। उदाहरण: =SUM(A1:A10), A1 से A10 तक सभी मानों को जोड़ता है।" },
      { "title": "फ़ॉर्मेटिंग और चार्ट", "content": "संख्याओं को फ़ॉर्मेट करें: Currency (₹), Percentage (%), Date फ़ॉर्मेट। Merge cells कई सेलों को मिलाता है। सेल बॉर्डर और शेडिंग दिखावट में सुधार करते हैं। चार्ट डेटा को दृश्य रूप में प्रस्तुत करते हैं: Column chart (मानों की तुलना), Pie chart (पूर्ण के भाग दिखाता है), Line chart (रुझान दिखाता है)। डेटा चुनें, Insert टैब पर क्लिक करें, चार्ट प्रकार चुनें।" }
    ]
  },
  {
    "id": "comp_7_3",
    "grade": 7,
    "subject": "कंप्यूटर (Computer)",
    "topic": "इंटरनेट और वेब ब्राउज़िंग",
    "keywords": ["इंटरनेट", "ब्राउज़र", "URL", "खोज", "ईमेल"],
    "summary": "इंटरनेट, वेब ब्राउज़र और ऑनलाइन जानकारी खोजना समझना।",
    "pages": [
      { "title": "इंटरनेट क्या है?", "content": "इंटरनेट आपस में जुड़े कंप्यूटरों का एक वैश्विक नेटवर्क है जो जानकारी साझा करते हैं। यह कहीं से भी सुलभ एक विशाल पुस्तकालय की तरह है। World Wide Web (WWW) इंटरनेट के माध्यम से एक्सेस किए गए परस्पर जुड़े दस्तावेज़ों और संसाधनों की एक प्रणाली है। उपयोग: संचार, शिक्षा, मनोरंजन, खरीदारी, बैंकिंग।" },
      { "title": "वेब ब्राउज़र और URLs", "content": "वेब ब्राउज़र इंटरनेट एक्सेस करने के लिए सॉफ्टवेयर है (Chrome, Firefox, Edge, Safari)। URL (Uniform Resource Locator) वेब पता है। उदाहरण: https://www.google.com। भाग: Protocol (https://), Domain name (google.com), Path (/search)। Homepage प्रारंभिक पृष्ठ है। Bookmarks त्वरित पहुंच के लिए पसंदीदा साइटों को सहेजते हैं।" },
      { "title": "जानकारी खोजना", "content": "Search Engine जानकारी खोजने में मदद करता है (Google, Bing, Yahoo)। खोज बॉक्स में keywords टाइप करें और Enter दबाएं। परिणाम प्रासंगिक वेबसाइटें दिखाते हैं। बेहतर परिणामों के लिए विशिष्ट keywords का उपयोग करें। सटीक वाक्यांश के लिए उद्धरण का उपयोग करें: 'Taj Mahal history'। Advanced search तिथि, प्रकार या क्षेत्र द्वारा परिणामों को फ़िल्टर करता है। विश्वसनीयता के लिए स्रोतों का मूल्यांकन करें।" },
      { "title": "ईमेल मूल बातें", "content": "Email (Electronic Mail) इंटरनेट पर संदेश भेजता है। ईमेल पता प्रारूप: username@domain.com। ईमेल के भाग: To (प्राप्तकर्ता), Subject (विषय), Body (संदेश), Attachments (फ़ाइलें)। Inbox प्राप्त ईमेल संग्रहीत करता है। Sent फ़ोल्डर भेजे गए ईमेल की प्रतियां रखता है। Spam अवांछित ईमेल है। कभी भी किसी के साथ पासवर्ड साझा न करें।" }
    ]
  },
  {
    "id": "comp_7_4",
    "grade": 7,
    "subject": "कंप्यूटर (Computer)",
    "topic": "PowerPoint प्रस्तुतियां",
    "keywords": ["पावरपॉइंट", "प्रस्तुति", "स्लाइड", "एनिमेशन", "डिज़ाइन"],
    "summary": "Microsoft PowerPoint का उपयोग करके आकर्षक प्रस्तुतियां बनाना।",
    "pages": [
      { "title": "PowerPoint का परिचय", "content": "Microsoft PowerPoint स्लाइड का उपयोग करके प्रस्तुतियां बनाता है। प्रत्येक स्लाइड टेक्स्ट, छवियों, चार्ट के साथ जानकारी प्रदर्शित करती है। स्कूल परियोजनाओं, व्यावसायिक बैठकों, व्याख्यानों के लिए उपयोग किया जाता है। मुख्य घटक: Slides pane (बाएं, सभी स्लाइड दिखाता है), Workspace (केंद्र, वर्तमान स्लाइड), Notes pane (नीचे, वक्ता नोट्स)।" },
      { "title": "स्लाइड बनाना", "content": "नई प्रस्तुति Title slide से शुरू होती है। स्लाइड जोड़ें: Home → New Slide। स्लाइड लेआउट: Title Slide, Title and Content, Two Content, Blank, आदि। सामग्री के आधार पर लेआउट चुनें। Text boxes टेक्स्ट रखते हैं। Placeholder boxes सामग्री प्लेसमेंट का मार्गदर्शन करते हैं। Home टैब से किसी भी समय लेआउट बदलें।" },
      { "title": "डिज़ाइन और फ़ॉर्मेटिंग", "content": "Design टैब में रंगों, फ़ॉन्ट और प्रभावों के साथ थीम हैं। सुसंगत रूप के लिए थीम लागू करें। Insert टैब चित्र, आकार, चार्ट, टेबल, आइकन जोड़ता है। चित्रों को फ़ॉर्मेट करें: resize, crop, rotate। WordArt सजावटी टेक्स्ट बनाता है। वस्तुओं को समान रूप से Align और Distribute करें। एक साथ चलने के लिए वस्तुओं को Group करें। Background styles स्लाइड पृष्ठभूमि बदलती हैं।" },
      { "title": "एनिमेशन और स्लाइडशो", "content": "एनिमेशन स्लाइड पर वस्तुओं को गतिशील बनाते हैं। वस्तु चुनें → Animations टैब → प्रभाव चुनें। Entrance (प्रकट होता है), Emphasis (हाइलाइट करता है), Exit (गायब हो जाता है)। अवधि और क्रम नियंत्रित करें। ट्रांज़िशन स्लाइड कैसे प्रकट होती हैं यह बदलते हैं। स्थिरता के लिए सभी स्लाइडों पर लागू करें। Slideshow: शुरुआत से शुरू करने के लिए F5 दबाएं, वर्तमान स्लाइड से Shift+F5। तीर कुंजियों या क्लिक से नेविगेट करें।" }
    ]
  },
  {
    "id": "comp_8_2",
    "grade": 8,
    "subject": "कंप्यूटर (Computer)",
    "topic": "Scratch प्रोग्रामिंग",
    "keywords": ["स्क्रैच", "प्रोग्रामिंग", "कोडिंग", "स्प्राइट", "ब्लॉक"],
    "summary": "Scratch का उपयोग करके दृश्य प्रोग्रामिंग का परिचय।",
    "pages": [
      { "title": "Scratch क्या है?", "content": "Scratch शुरुआती लोगों के लिए एक दृश्य प्रोग्रामिंग भाषा है। MIT द्वारा बनाई गई, यह टेक्स्ट कोड के बजाय रंगीन ब्लॉकों का उपयोग करती है। आप ब्लॉकों को एक साथ जोड़कर इंटरैक्टिव कहानियां, गेम और एनिमेशन बनाते हैं। Sprite एक पात्र या वस्तु है। Stage वह क्षेत्र है जहां sprites प्रदर्शन करते हैं। Scratch तर्क, अनुक्रम और समस्या-समाधान सिखाता है।" },
      { "title": "Scratch इंटरफ़ेस", "content": "Stage (ऊपर दाएं) आउटपुट दिखाता है। Sprite List (stage के नीचे) सभी sprites प्रदर्शित करता है। Blocks Palette (बाएं) श्रेणियों में कोडिंग ब्लॉक हैं: Motion (sprite स्थानांतरित करें), Looks (दिखावट), Sound (ऑडियो), Events (क्रियाएं शुरू करें), Control (loops, conditions), Sensing (पता लगाएं), Operators (गणित), Variables (डेटा संग्रहीत करें)।" },
      { "title": "बुनियादी प्रोग्रामिंग अवधारणाएं", "content": "Sequence: ब्लॉक ऊपर से नीचे क्रम में निष्पादित होते हैं। Loop: Forever, Repeat ब्लॉकों का उपयोग करके क्रियाओं को दोहराएं। उदाहरण: Repeat 10 times, Move 10 steps sprite को कुल 100 steps चलाता है। Conditions: If-Then ब्लॉक शर्तों की जांच करते हैं। उदाहरण: If touching edge, bounce। Variables स्कोर जैसे मान संग्रहीत करते हैं। Events जैसे 'When green flag clicked' scripts शुरू करते हैं।" },
      { "title": "सरल प्रोजेक्ट बनाना", "content": "Sprite चलाना: 'move 10 steps', 'turn 15 degrees' जैसे Motion ब्लॉकों का उपयोग करें। Costume change एनिमेशन प्रभाव बनाता है। Sensing ब्लॉक माउस, कीबोर्ड, अन्य sprites का पता लगाते हैं। उदाहरण प्रोजेक्ट: एक बिल्ली को माउस का पीछा करवाएं। 'point towards mouse' और 'move steps' का उपयोग करें। पकड़ने का पता लगाने के लिए 'if touching mouse' जोड़ें। Broadcast sprites के बीच इंटरैक्शन के लिए संदेश भेजता है।" }
    ]
  },
  {
    "id": "comp_8_3",
    "grade": 8,
    "subject": "कंप्यूटर (Computer)",
    "topic": "HTML मूल बातें",
    "keywords": ["HTML", "वेबपेज", "टैग्स", "ब्राउज़र", "तत्व"],
    "summary": "HTML का उपयोग करके सरल वेब पेज बनाना।",
    "pages": [
      { "title": "HTML का परिचय", "content": "HTML (HyperText Markup Language) वेब पेज बनाने के लिए मानक भाषा है। यह सामग्री को संरचित करने के लिए टैग का उपयोग करता है। ब्राउज़र HTML पढ़ता है और पेज प्रदर्शित करता है। HTML फ़ाइल का .html या .htm एक्सटेंशन होता है। HTML एक प्रोग्रामिंग भाषा नहीं है; यह एक मार्कअप भाषा है जो संरचना और सामग्री को परिभाषित करती है।" },
      { "title": "HTML संरचना और टैग", "content": "मूल संरचना: <!DOCTYPE html> HTML5 घोषित करता है। <html> मूल तत्व। <head> metadata, title शामिल करता है। <body> दृश्य सामग्री शामिल करता है। टैग कोण कोष्ठक में संलग्न होते हैं: <tagname>। अधिकांश टैगों में opening <tag> और closing </tag> होता है। उदाहरण: <p>यह पैराग्राफ है</p>। कुछ टैग self-closing हैं जैसे लाइन ब्रेक के लिए <br/>, छवि के लिए <img/>।" },
      { "title": "सामान्य HTML तत्व", "content": "शीर्षक: <h1> सबसे बड़ा से <h6> सबसे छोटा। पैराग्राफ: <p>। Bold: <b> या <strong>। Italic: <i> या <em>। लाइन ब्रेक: <br/>। क्षैतिज रेखा: <hr/>। सूचियां: <ul> क्रमरहित (bullets), <ol> क्रमबद्ध (numbers), <li> सूची आइटम। Link: <a href='url'>text</a>। Image: <img src='file.jpg' alt='description'/>।" },
      { "title": "पहला वेबपेज बनाना", "content": "Notepad खोलें, HTML कोड टाइप करें। उदाहरण:\n<!DOCTYPE html>\n<html>\n<head>\n  <title>मेरा पेज</title>\n</head>\n<body>\n  <h1>स्वागत है</h1>\n  <p>यह मेरा पहला वेबपेज है।</p>\n</body>\n</html>\n'page.html' के रूप में सहेजें। देखने के लिए ब्राउज़र से खोलें। Attributes अतिरिक्त जानकारी प्रदान करते हैं: href (link destination), src (image source), alt (alternative text)।" }
    ]
  },
  {
    "id": "comp_8_4",
    "grade": 8,
    "subject": "कंप्यूटर (Computer)",
    "topic": "डेटाबेस अवधारणाएं",
    "keywords": ["डेटाबेस", "टेबल", "रिकॉर्ड", "फ़ील्ड", "DBMS"],
    "summary": "डेटाबेस और उनके संगठन को समझना।",
    "pages": [
      { "title": "डेटाबेस क्या है?", "content": "डेटाबेस इलेक्ट्रॉनिक रूप से संग्रहीत संबंधित डेटा का एक संगठित संग्रह है। बड़ी मात्रा में जानकारी को कुशलता से संग्रहीत करने के लिए उपयोग किया जाता है। उदाहरण: स्कूल डेटाबेस (छात्र, शिक्षक, अंक), पुस्तकालय डेटाबेस (पुस्तकें, सदस्य, जारी), बैंक डेटाबेस (खाते, लेनदेन)। डेटा को आसानी से खोजा, क्रमबद्ध और पुनर्प्राप्त किया जा सकता है।" },
      { "title": "डेटाबेस संरचना", "content": "Table: पंक्तियों और स्तंभों में व्यवस्थित डेटा। Record (पंक्ति): एक आइटम के बारे में जानकारी का पूरा सेट। Field (स्तंभ): जानकारी का एक एकल टुकड़ा। उदाहरण: Student टेबल में प्रत्येक छात्र के लिए रिकॉर्ड होते हैं। फ़ील्ड: Roll No, Name, Class, Marks। Primary Key प्रत्येक रिकॉर्ड को विशिष्ट रूप से पहचानती है (जैसे Roll No)।" },
      { "title": "DBMS और उदाहरण", "content": "DBMS (Database Management System) डेटाबेस बनाने और प्रबंधित करने के लिए सॉफ्टवेयर है। उदाहरण: MS Access, MySQL, Oracle, SQLite। लाभ: डेटा अतिरेक कम करें, अद्यतन करना आसान, कई उपयोगकर्ता एक्सेस कर सकते हैं, डेटा सुरक्षा, बैकअप और रिकवरी। Queries शर्तों के आधार पर विशिष्ट डेटा पुनर्प्राप्त करती हैं।" },
      { "title": "वास्तविक दुनिया के अनुप्रयोग", "content": "स्कूल छात्र रिकॉर्ड, उपस्थिति, परिणामों के लिए डेटाबेस का उपयोग करते हैं। बैंक खाता जानकारी, लेनदेन संग्रहीत करते हैं। अस्पताल रोगी रिकॉर्ड, अपॉइंटमेंट, चिकित्सा इतिहास बनाए रखते हैं। ई-कॉमर्स साइटें उत्पाद, ग्राहक, ऑर्डर संग्रहीत करती हैं। सोशल मीडिया प्लेटफ़ॉर्म उपयोगकर्ता प्रोफ़ाइल, पोस्ट, कनेक्शन संग्रहीत करते हैं। डेटाबेस जानकारी प्रबंधन को कुशल और संगठित बनाते हैं।" }
    ]
  },
  {
    "id": "comp_8_5",
    "grade": 8,
    "subject": "कंप्यूटर (Computer)",
    "topic": "कंप्यूटर नेटवर्क",
    "keywords": ["नेटवर्क", "LAN", "WAN", "टोपोलॉजी", "प्रोटोकॉल"],
    "summary": "कंप्यूटर नेटवर्क और उनके प्रकारों को समझना।",
    "pages": [
      { "title": "नेटवर्क क्या है?", "content": "कंप्यूटर नेटवर्क आपस में जुड़े कंप्यूटरों का एक समूह है जो संसाधनों और जानकारी को साझा करता है। लाभ: फ़ाइलें, प्रिंटर, इंटरनेट कनेक्शन साझा करें। ईमेल, संदेशों के माध्यम से संचार। नेटवर्क डिवाइस: Router (नेटवर्क जोड़ता है), Switch (नेटवर्क में डिवाइस जोड़ता है), Hub (बुनियादी कनेक्टर), Modem (इंटरनेट से जोड़ता है)।" },
      { "title": "नेटवर्क के प्रकार", "content": "LAN (Local Area Network): छोटे क्षेत्र जैसे घर, स्कूल, कार्यालय को कवर करता है। उच्च गति, कम लागत। उदाहरण: कंप्यूटर लैब नेटवर्क। MAN (Metropolitan Area Network): एक शहर को कवर करता है। उदाहरण: केबल टीवी नेटवर्क। WAN (Wide Area Network): देश या विश्व जैसे बड़े क्षेत्र को कवर करता है। उदाहरण: इंटरनेट। कवरेज बढ़ने के साथ गति घटती है।" },
      { "title": "नेटवर्क टोपोलॉजी", "content": "टोपोलॉजी नेटवर्क की भौतिक/तार्किक व्यवस्था है। Bus: सभी डिवाइस एक ही केबल से जुड़े। Star: सभी डिवाइस केंद्रीय hub/switch से जुड़े (सबसे आम)। Ring: डिवाइस गोलाकार फ़ैशन में जुड़े। Mesh: प्रत्येक डिवाइस हर दूसरे डिवाइस से जुड़ा। Tree: Bus और star टोपोलॉजी का संयोजन।" },
      { "title": "प्रोटोकॉल और मानक", "content": "Protocol संचार के लिए नियमों का एक सेट है। TCP/IP (Transmission Control Protocol/Internet Protocol): मुख्य इंटरनेट प्रोटोकॉल। HTTP (HyperText Transfer Protocol): वेब पेजों के लिए। FTP (File Transfer Protocol): फ़ाइल स्थानांतरण के लिए। SMTP (Simple Mail Transfer Protocol): ईमेल के लिए। IP Address नेटवर्क पर डिवाइस को विशिष्ट रूप से पहचानता है।" }
    ]
  }
]